In [1]:
import pandas as pd
import sqlalchemy as db

In [2]:
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/retail_db")
conn = engine.connect()

In [3]:
df_customers = pd.read_sql_table('customers', engine)
df_orders = pd.read_sql_table('orders', engine)
df_order_items = pd.read_sql_table('order_items', engine)
df_products = pd.read_sql_table('products', engine)
df_categories = pd.read_sql_table('categories', engine)
df_departments = pd.read_sql_table('departments', engine)

In [4]:
# Numero de clientes
total_clientes = df_customers['customer_id'].nunique()
print(total_clientes)

12435

In [5]:
# Distribucion de clientes
cliente_x_state = df_customers['customer_state'].value_counts()
print(cliente_x_state)

customer_state
PR    4771
CA    2012
NY     775
TX     635
IL     523
FL     374
OH     276
PA     261
MI     254
NJ     219
AZ     213
GA     169
MD     164
NC     150
VA     136
CO     122
OR     119
MA     113
TN     104
NV     103
MO      92
HI      87
CT      73
NM      73
WA      72
UT      69
WI      64
LA      63
DC      42
SC      41
IN      40
MN      39
KY      35
KS      29
DE      23
OK      19
WV      16
RI      15
ND      14
AR      12
ID       9
MT       7
IA       5
AL       3
Name: count, dtype: int64

In [6]:
df_customers['customer_city'].value_counts()

customer_city
Caguas           4584
Chicago           274
Brooklyn          225
Los Angeles       224
New York          120
                 ...
Hempstead           3
Freehold            2
Ponce               2
National City       2
Gwynn Oak           2
Name: count, Length: 562, dtype: int64

In [7]:
df_categories.groupby('category_department_id')['category_id'].count()

category_department_id
2     8
3     8
4     6
5     7
6    12
7     7
8    10
Name: category_id, dtype: int64

In [8]:
distribucion = df_categories.merge(df_departments, left_on='category_department_id', right_on='department_id')
distribucion['department_name'].value_counts()

department_name
Outdoors    12
Fitness      8
Footwear     8
Golf         7
Fan Shop     7
Apparel      6
Name: count, dtype: int64

In [9]:
# Producto mas caro
print('producto mas caro')
print(df_products.loc[df_products['product_price'].idxmax()])
# Producto mas barato

print("\nproducto mas barato")
print(df_products.loc[df_products['product_price'].idxmin()])

producto mas caro
product_id                                                           208
product_category_id                                                   10
product_name                                         SOLE E35 Elliptical
product_description
product_price                                                    1999.99
product_image          http://images.acmesports.sports/SOLE+E35+Ellip...
Name: 207, dtype: object

producto mas barato
product_id                                                            38
product_category_id                                                    3
product_name               Nike Men's Hypervenom Phantom Premium FG Socc
product_description
product_price                                                        0.0
product_image          http://images.acmesports.sports/Nike+Men%27s+H...
Name: 37, dtype: object

In [10]:
# El total gastado por cada cliente
# Categorias con mas ventas
# Promedio de ingreso por mes

In [12]:
# Cuales son los productos mas comprados por cada cliente
productos_x_cliente = df_order_items.merge(df_orders, left_on='order_item_order_id', right_on='order_id')
productos_x_cliente = productos_x_cliente.groupby(['order_customer_id', 'order_item_product_id'])['order_item_quantity'].sum().reset_index()
productos_x_cliente.loc[productos_x_cliente.groupby('order_customer_id')['order_item_quantity'].idxmax()]

       order_customer_id  order_item_product_id  order_item_quantity
0                      1                    191                    5
6                      2                   1014                    7
10                     3                    365                   13
17                     4                    365                   19
27                     5                   1014                    6
...                  ...                    ...                  ...
92839              12431                    502                   22
92855              12432                   1014                   19
92859              12433                    627                   11
92866              12434                    502                   10
92870              12435                    191                    5

[12331 rows x 3 columns]

In [22]:
# Promedio de ingreso por dia
df_promedio = df_orders.merge(df_order_items, left_on='order_id', right_on='order_item_order_id', how='left')
df_promedio[['order_id', 'order_date', 'order_item_subtotal']].drop_duplicates()\
.groupby('order_date').sum()['order_item_subtotal'] / df_promedio[['order_date','order_item_order_id']].drop_duplicates()\
.groupby('order_date').count()['order_item_order_id']

order_date
2013-07-25    548.313017
2013-07-26    547.643219
2013-07-27    531.000286
2013-07-28    519.895443
2013-07-29    590.545833
                 ...
2014-07-20    539.775950
2014-07-21    554.769455
2014-07-22    572.947692
2014-07-23    601.890145
2014-07-24    550.647152
Length: 364, dtype: float64

In [17]:
df_promedio[['order_date','order_item_order_id']].drop_duplicates()

       order_date  order_item_order_id
0      2013-07-25                  1.0
1      2013-07-25                  2.0
4      2013-07-25                  NaN
5      2013-07-25                  4.0
9      2013-07-25                  5.0
...           ...                  ...
183637 2014-07-09              68879.0
183640 2014-07-13              68880.0
183645 2014-07-19              68881.0
183646 2014-07-22              68882.0
183648 2014-07-23              68883.0

[57795 rows x 2 columns]

In [20]:
df_order_items

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

In [11]:
cliente_producto = df_products.merge(df_order_items,left_on='product_id',right_on='order_item_product_id')
cliente_producto.groupby('product_name')['product_name'].count().sort_values(ascending=False)

product_name
Perfect Fitness Perfect Rip Deck                 24515
Nike Men's CJ Elite 2 TD Football Cleat          22246
Nike Men's Dri-FIT Victory Golf Polo             21035
O'Brien Men's Neoprene Life Vest                 19298
Field & Stream Sportsman 16 Gun Fire Safe        17325
                                                 ...
Stiga Master Series ST3100 Competition Indoor       27
SOLE E35 Elliptical                                 15
Bushnell Pro X7 Jolt Slope Rangefinder              11
Bowflex SelectTech 1090 Dumbbells                   10
SOLE E25 Elliptical                                 10
Name: product_name, Length: 100, dtype: int64